{
  "password": {
    "placeholder": "Enter password",
    "submit": "Enter",
    "error": "Incorrect password, please try again"
  },
  "nav": {
    "home": "Home",
    "story": "Our Story",
    "travel": "Travel",
    "schedule": "Schedule",
    "registry": "Registry"
  },
  "home": {
    "date": "August 28, 2026",
    "location": "Wailea, Hawaii",
    "couple": "Dana & Jaicob",
    "message": "We can’t wait to share this special day with you.\n Come celebrate a late-summer night with us.",
    "rsvp": "RSVP",
    "countdown": {
      "days": "Days",
      "hours": "Hours",
      "minutes": "Minutes",
      "seconds": "Seconds"
    }
  },
  "story": {
    "title": "Our Story",
    "chest": "This was our story.",
    "hint": "Explore the illustration to discover our journey",
    "wisdom": "Love is patient, love is kind. It always protects, always trusts, always hopes, always perseveres.",
    "placeholder": "A chapter of our story...",
    "entries": [
      "The day we first met — a moment that changed everything.",
      "Our first adventure together — the start of something beautiful.",
      "The moment we knew — when words weren't needed anymore.",
      "Growing together — building a life side by side.",
      "The proposal — a question and an answer that lasts forever."
    ]
  },
  "travel": {
    "title": "Travel",
    "message": "We know that traveling for a destination wedding can take extra time and planning, and we completely understand if you’re not able to join us in person. We are so grateful for your love and well wishes.\n\nIf you’re able to make the trip, we’re so excited to celebrate together! Below you’ll find directions to the venue and a few places to stay.",
    "flightsTitle": "Flights",
    "flightsLabel": "Airport",
    "hotelTitle": "Where to Stay",
    "hotelLabel": "Our Venue",
    "viewHotel": "View Hotel",
    "tipsTitle": "Travel Tips",
    "navFlights": "Flights",
    "navHotel": "Stay",
    "navTips": "Tips",
    "altLabel": "Alternative Options",
    "flightsAirport": "Kahului Airport (OGG)",
    "flightsBody": "Kahului Airport (OGG) is the main airport on Maui. Wailea is about a 25–30 minute drive from the airport.",
    "flightsLayover": "There are not many direct flights to Maui from most cities — you'll likely connect through Honolulu (HNL) before a short 45-minute hop to Kahului.",
    "gettingAroundTitle": "Getting Around the Island",
    "navGettingAround": "Getting Around",
    "gettingAround": [
      {
        "icon": "car",
        "heading": "Rental Car",
        "body": "If you're planning to explore the island before or after the wedding, we recommend renting a car so you can fully enjoy Maui's beaches, scenic drives, and hidden gems."
      },
      {
        "icon": "rideshare",
        "heading": "Rideshare",
        "body": "If you'd rather keep things simple, Uber and Lyft are available and can take you directly to the venue and around Wailea."
      }
    ],
    "hotel": {
      "name": "Hotel Wailea",
      "description": "We're getting married at Hotel Wailea, and have special discounted rates for our guests. Book through the Hotel Wailea website and enter the promo code below. The discount code is valid between August 25 - September 2, 2026.",
      "note": "We'd love for everyone to stay close by and make a weekend of it, so we recommend booking early before rooms fill up.",
      "promoLabel": "Discount Code",
      "link": "https://www.hotelwailea.com",
      "linkText": "View Hotel"
    },
    "altHotelsNote": "If you're looking for other options, there are lots of great places to stay nearby in Wailea too — whatever works best for you!",
    "altHotels": [
      { "name": "Residence Inn By Marriott Maui Wailea", "link": "https://www.marriott.com/en-us/hotels/hnmri-residence-inn-maui-wailea/overview/" },
      { "name": "Wailea Beach Resort — Marriott, Maui", "link": "https://www.marriott.com/en-us/hotels/hnmmc-wailea-beach-resort-marriott-maui/overview/" }
    ],
    "tips": [
      "Late August in Maui is warm and sunny — expect temperatures around 85°F (29°C).",
      "Don't forget reef-safe sunscreen! Hawaii law requires it to protect the coral reefs.",
      "If you're extending your trip, the Road to Hana, Haleakalā sunrise, and snorkeling at Molokini are must-dos."
    ]
  },
  "schedule": {
    "title": "Schedule",
    "events": [
      { "time": "2:00 PM", "title": "Ceremony", "description": "Join us as we say our vows", "location": "Venue details coming soon" },
      { "time": "3:00 PM", "title": "Cocktail Hour", "description": "Drinks and light bites while we take photos", "location": "" },
      { "time": "4:30 PM", "title": "Reception", "description": "Dinner, toasts, and dancing", "location": "" },
      { "time": "9:00 PM", "title": "After Party", "description": "Keep the celebration going", "location": "" }
    ]
  },
  "registry": {
    "title": "Registry",
    "message": "Your presence at our wedding is the greatest gift of all. If you wish to honor us with a gift, we've created a small registry.",
    "linkText": "View Our Registry",
    "url": "#"
  },
  "storyBook": {
    "title": "Our Story",
    "subtitle": "The chapters that led us here",
    "statementLine1": "A love story, written",
    "statementLine2": "one chapter at a time.",
    "chapters": [
      {
        "label": "Chapter One",
        "title": "A Chance Encounter",
        "text": "Some stories begin with a grand gesture, but ours started with a quiet moment — a glance across a room, an unexpected conversation, and the feeling that something had just shifted."
      },
      {
        "label": "Chapter Two",
        "title": "First Adventures",
        "text": "What started as coffee dates turned into long weekends exploring new places together. Every trip revealed something new — not just about the world, but about each other."
      },
      {
        "label": "Chapter Three",
        "title": "Growing Together",
        "text": "Life isn't always easy, but facing it together made all the difference. Through late nights, big moves, and quiet evenings at home, we built something that felt unshakeable."
      },
      {
        "label": "Chapter Four",
        "title": "The Question",
        "text": "There are moments you replay in your mind forever. A heartbeat of silence before the answer, and then — everything changed, and nothing changed at all."
      },
      {
        "label": "Chapter Five",
        "title": "The Next Chapter",
        "text": "And now we stand at the beginning of something new. With all of you beside us, we're ready to write the rest of this story — together."
      }
    ]
  }
}
